In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
data=pd.read_csv('Placement_Data_Full_Class.csv')
data.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          148 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

In [5]:
data.isnull().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [6]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
sl_no,215.0,108.000000,62.209324,1.00,54.500,108.0,161.500,215.00
ssc_p,215.0,67.303395,10.827205,40.89,60.600,67.0,75.700,89.40
hsc_p,215.0,66.333163,10.897509,37.00,60.900,65.0,73.000,97.70
degree_p,215.0,66.370186,7.358743,50.00,61.000,66.0,72.000,91.00
etest_p,215.0,72.100558,13.275956,50.00,60.000,71.0,83.500,98.00
mba_p,215.0,62.278186,5.833385,51.21,57.945,62.0,66.255,77.89
salary,148.0,288655.405405,93457.452420,200000.00,240000.000,265000.0,300000.000,940000.00

In [7]:
data.drop(['sl_no', 'salary'], axis = 1, inplace = True)

In [8]:
data.shape

(215, 13)

In [9]:
data.head()

,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status
0,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed
1,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed
2,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed
3,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed
4,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed

In [10]:
print(data['status'].value_counts())

Placed        148
Not Placed     67
Name: status, dtype: int64

In [11]:
print(data['gender'].unique())

['M' 'F']

In [12]:
data=pd.get_dummies(data,drop_first=True)

In [13]:
data.head()

,ssc_p,hsc_p,degree_p,etest_p,mba_p,gender_M,ssc_b_Others,hsc_b_Others,hsc_s_Commerce,hsc_s_Science,degree_t_Others,degree_t_Sci&Tech,workex_Yes,specialisation_Mkt&HR,status_Placed
0,67.00,91.00,58.00,55.0,58.80,1,1,1,1,0,0,1,0,1,1
1,79.33,78.33,77.48,86.5,66.28,1,0,1,0,1,0,1,1,0,1
2,65.00,68.00,64.00,75.0,57.80,1,0,0,0,0,0,0,0,0,1
3,56.00,52.00,52.00,66.0,59.43,1,0,0,0,1,0,1,0,1,0
4,85.80,73.60,73.30,96.8,55.50,1,0,0,1,0,0,0,0,0,1

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ssc_p                  215 non-null    float64
 1   hsc_p                  215 non-null    float64
 2   degree_p               215 non-null    float64
 3   etest_p                215 non-null    float64
 4   mba_p                  215 non-null    float64
 5   gender_M               215 non-null    uint8
 6   ssc_b_Others           215 non-null    uint8
 7   hsc_b_Others           215 non-null    uint8
 8   hsc_s_Commerce         215 non-null    uint8
 9   hsc_s_Science          215 non-null    uint8
 10  degree_t_Others        215 non-null    uint8
 11  degree_t_Sci&Tech      215 non-null    uint8
 12  workex_Yes             215 non-null    uint8
 13  specialisation_Mkt&HR  215 non-null    uint8
 14  status_Placed          215 non-null    uint8
dtypes: float64(5), uint8(10)
memory usage: 10.6 KB

In [15]:
from sklearn.model_selection import train_test_split
x = data.drop('status_Placed', axis = 1)
y = data['status_Placed']
xtrain, xtest, ytrain, ytest = train_test_split(x, y, test_size = 0.25, random_state = 0)

In [16]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
data=scaler.fit_transform(xtrain)

In [17]:
from sklearn.ensemble import AdaBoostClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score, f1_score, precision_score, recall_score

In [18]:
abc = AdaBoostClassifier()
abc.fit(xtrain, ytrain)
pred = abc.predict(xtest)

In [19]:
accuracy = accuracy_score(ytest, pred)
print('Acur치cia: %f' % accuracy)

precision = precision_score(ytest, pred)
print('Precision: %f' % precision)

recall = recall_score(ytest, pred)
print('Recall: %f' % recall)

f1 = f1_score(ytest, pred)
print('F1-Score: %f' % f1)

Acur치cia: 0.833333
Precision: 0.850000
Recall: 0.918919
F1-Score: 0.883117

In [20]:
lr = LogisticRegression(solver = 'liblinear') 
lr.fit(xtrain, ytrain)
pred = lr.predict(xtest)

In [21]:
accuracy = accuracy_score(ytest, pred)
print('Acur치cia: %f' % accuracy)

precision = precision_score(ytest, pred)
print('Precision: %f' % precision)

recall = recall_score(ytest, pred)
print('Recall: %f' % recall)

f1 = f1_score(ytest, pred)
print('F1-Score: %f' % f1)

Acur치cia: 0.814815
Precision: 0.829268
Recall: 0.918919
F1-Score: 0.871795

In [22]:
print(lr.predict([[67.00,91.00,58.00,55.0,58.80,1,1,1,1,0,0,1,0,1]]))

[1]

c:\Users\savar\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LogisticRegression was fitted with feature names
  warnings.warn(

In [23]:
import pickle as pkl
pkl.dump(lr,open("Placment.pkl","wb"))

In [24]:
model = pkl.load(open("placement.pkl","rb"))
print(type(model))

<class 'sklearn.linear_model._logistic.LogisticRegression'>